{
    "lessonTitle": "Energy Stores & Systems",
    "lessonCode": "PHY_10_01",
    "subject": "PHYSICS",
    "topic": "Energy Stores & Systems",
    "level": "GCSE",
    "yearGroup": "YEAR_10",
    "term": "Autumn",
    "duration": "60 minutes",
    "summary": "In this lesson, students will learn about the different types of energy stores, how energy can be transferred, and the concepts of open and closed systems as well as work done. The lesson will include interactive discussions and practical examples to enhance understanding.",
    "link_to_specification": "https://www.example.com/gcse_physics_specification",
    "link_to_resources": null,
    "learning_objectives": [
        {
            "description": "Understand the different types of energy stores and how energy can be transferred.",
            "successCriteria": [
                "Identify and describe at least three types of energy stores.",
                "Explain how energy can be transferred between stores.",
                "Differentiate between open and closed systems.",
                "Define 'work done' and apply it to examples."
            ]
        }
    ],
    "lesson_structure": {
        "starter": {
            "topic": "Introduction to Energy",
            "sub_topic": null,
            "duration": "10 minutes"
        },
        "main_activities": [
            {
                "duration": "20 minutes",
                "topic": "Types of Energy Stores",
                "sub_topic": null,
                "activity": "Explain the different types of energy stores using diagrams and examples. Include a quick quiz at the end to assess understanding.",
                "activity_type": "explanation",
                "materials": "Diagrams of energy stores, whiteboard, markers, quiz handouts."
            },
            {
                "duration": "15 minutes",
                "topic": "Energy Transfer",
                "sub_topic": null,
                "activity": "Group work to explore how energy can be transferred between stores through practical examples. Students will create a flow chart of energy transfer.",
                "activity_type": "group_work",
                "materials": "Energy transfer scenarios handouts, large paper for flow charts."
            },
            {
                "duration": "15 minutes",
                "topic": "Open and Closed Systems",
                "sub_topic": null,
                "activity": "Discussion on open and closed systems with real-world examples. Use guided questions to facilitate deeper thinking.",
                "activity_type": "discussion",
                "materials": "Example scenarios of open and closed systems, guided questions handout."
            }
        ],
        "plenary": {
            "duration": "10 minutes",
            "topic": "Review and Reflect",
            "sub_topic": null,
            "activity": "Students summarize their learning and share one new thing they learned about energy stores and systems. Conduct a quick feedback session to gather their thoughts on the lesson.",
            "activity_type": "plenary",
            "materials": "Reflection sheets, feedback forms."
        }
    },
    "teacher_notes": "Encourage students to think critically about real-life applications of energy stores and systems. Use questions to facilitate discussion and engage students actively throughout the lesson. Provide additional resources for students who may want to explore the topic further."
}